[
    {
      "id": 1,
      "title": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://books.google.co.ke/books/publisher/content?id=-D8WBAAAQBAJ&pg=PP1&img=1&zoom=3&hl=en&bul=1&sig=ACfU3U3AwaumJtl84JUpuJEBFvfIHCKKvA&w=1280",
      "description": "A classic novel about racial injustice and moral growth in the American South.",
      "detailedDescription": "Set in the 1930s in the fictional town of Maycomb, Alabama, this classic novel follows the Finch family and their experiences with racial injustice. Through the eyes of young Scout Finch, readers witness the trial of a black man, Tom Robinson, falsely accused of raping a white woman. The novel explores themes of morality, compassion, and the complexities of human nature."
    },
    {
      "id": 2,
      "title": "1984",
      "author": "George Orwell",
      "image": "https://books.google.co.ke/books/publisher/content?id=JT_JDAAAQBAJ&pg=PP1&img=1&zoom=3&hl=en&bul=1&sig=ACfU3U2MsxEnlYvYoweHkHNtYR5CpLNAOA&w=1280",
      "description": "A dystopian novel that explores themes of totalitarianism, propaganda, and individualism.",
      "detailedDescription": "In a totalitarian future society, Winston Smith works for the Party, rewriting history to fit its propaganda. As he begins to rebel against the oppressive regime, he falls in love with Julia, leading to their eventual capture and torture. Orwell's dystopian masterpiece warns of the dangers of totalitarianism, surveillance, and the manipulation of truth"
    },
    {
      "id": 3,
      "title": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://books.google.co.ke/books/publisher/content?id=WpD_DAAAQBAJ&pg=PP1&img=1&zoom=3&hl=en&bul=1&sig=ACfU3U2smY1XG0tjSZpqcsPWGRs18i-NFg&w=1280",
      "description": "A tale of love and tragedy set against the backdrop of the Jazz Age in America.",
      "detailedDescription": "Set in the Roaring Twenties, this novel follows the mysterious Jay Gatsby and his obsession with the beautiful Daisy Buchanan. Through the eyes of narrator Nick Carraway, readers are immersed in the glittering world of wealth, parties, and excess, ultimately revealing the emptiness and tragedy beneath the surface."
    },
    {
      "id": 4,
      "title": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://books.google.co.ke/books/content?id=kQ0mAAAAMAAJ&pg=PP1&img=1&zoom=3&hl=en&bul=1&sig=ACfU3U37zPGoOr2IU2f0PCVIexnC5nPGag&w=1280",
      "description": "A romantic novel that satirizes the British upper class during the Regency era.",
      "detailedDescription": "Austen's romantic comedy of manners follows the spirited Elizabeth Bennet as she navigates the social hierarchy of early 19th-century England. Through misunderstandings, witty banter, and societal expectations, Elizabeth and the proud Mr. Darcy overcome their initial prejudices to find love and understanding"
    },
    {
      "id": 5,
      "title": "Moby Dick",
      "author": "Herman Melville",
      "image": "https://books.google.co.ke/books/content?id=cyrMu-gkGQQC&pg=PP1&img=1&zoom=3&hl=en&bul=1&sig=ACfU3U00eaWZgj0FjvrHUpX5feSpc58pJg&w=1280",
      "description": "An epic sea adventure that delves into themes of obsession, nature, and the human spirit.",
      "detailedDescription": "Captain Ahab's obsessive quest for revenge against the elusive white whale, Moby Dick, drives this epic tale of adventure on the high seas. As Ishmael narrates the journey aboard the whaling ship Pequod, Melville explores themes of fate, obsession, and the inherent conflict "
    },
    {
      "id": 6,
      "title": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://books.google.co.ke/books/content?id=j--EMdEfmbkC&pg=PA28&img=1&pgis=1&dq=the+catcher+in+rye&bul=1&sig=ACfU3U1plNRXn_a75khyswGYFu26AzO5sQ&edge=0",
      "description": "A coming-of-age story that follows a teenage boy's journey through New York City.",
      "detailedDescription": "Narrated by the disillusioned teenager Holden Caulfield, this coming-of-age novel captures the angst and alienation of adolescence. As Holden wanders the streets of New York City, grappling with the phoniness of adult society, readers are drawn into his search for authenticity and connection."
    },
    {
      "id": 7,
      "title": "The Lord of the Rings",
      "author": "J.R.R. Tolkien",
      "image": "https://upload.wikimedia.org/wikipedia/en/a/a1/Lord_Rings_Two_Towers.jpg",
      "description": "An epic fantasy series that explores the battle between good and evil in Middle-earth.",
      "detailedDescription": "Set in the fantastical world of Middle-earth, this epic fantasy trilogy follows the quest to destroy the One Ring and defeat the dark lord Sauron. Frodo Baggins, accompanied by a fellowship of diverse characters, embarks on a perilous journey through enchanted lands, facing battles, betrayals, and the ultimate test of courage."
    },
    {
      "id": 8,
      "title": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://books.google.co.ke/books/publisher/content?id=Vbb3EAAAQBAJ&pg=PA1&img=1&zoom=3&hl=en&bul=1&sig=ACfU3U14HUvYfa4Ztp0VyhWZJF6JpLHniQ&w=1280",
      "description": "A prelude to 'The Lord of the Rings' that introduces the world of Middle-earth and its inhabitants.",
      "detailedDescription": "Bilbo Baggins, a reluctant hobbit, is swept into an unexpected adventure when the wizard Gandalf and a band of dwarves recruit him to reclaim their homeland from the dragon Smaug. Along the way, Bilbo encounters trolls, goblins, and elves, discovering courage and friendship in the face of danger."
    },
    {
      "id": 9,
      "title": "The Grapes of Wrath",
      "author": "John Steinbeck",
      "image": "https://books.google.co.ke/books/content?id=fUoQFk8aTCkC&pg=PP1&img=1&zoom=3&hl=en&bul=1&sig=ACfU3U1QZuk83HucHFgY1TEjC_DKdW7BcQ&w=1280",
      "description": "A novel that portrays the struggles of a family of tenant farmers during the Dust Bowl and the Great Depression.",
      "detailedDescription": "Set during the Great Depression, this novel follows the Joad family as they journey from Oklahoma to California in search of a better life. Steinbeck's powerful portrayal of poverty, exploitation, and resilience highlights the struggles of migrant workers and the human spirit's enduring strength"
    },
    {
      "id": 10,
      "title": "The Odyssey",
      "author": "Homer",
      "image": "https://books.google.co.ke/books/publisher/content?id=3bsmCwAAQBAJ&pg=PP1&img=1&zoom=3&hl=en&bul=1&sig=ACfU3U3ARPqvFXAWC2ptPqTKaMxFThtlHw&w=1280",
      "description": "An epic poem that recounts the adventures of Odysseus on his long journey home after the Trojan War.",
      "detailedDescription": "Homer's epic poem recounts the ten-year journey of Odysseus as he seeks to return home to Ithaca after the Trojan War. Facing mythical creatures, vengeful gods, and the trials of mortal men, Odysseus embodies the virtues of cunning, perseverance, and heroism on his quest for nostos, or homecoming."
    },
    {
      "id": 11,
      "title": "The Divine Comedy",
      "author": "Dante Alighieri",
      "image": "https://books.google.co.ke/books/content?id=wmacUwleJv8C&pg=PA3&img=1&zoom=3&hl=en&bul=1&sig=ACfU3U0XGiCr3aAkBB6yM65RoKgcI5OVUA&w=1280",
      "description": "A narrative poem that describes Dante's journey through Hell, Purgatory, and Paradise.",
      "detailedDescription": "Dante's epic poem follows his journey through the three realms of the afterlife: Hell (Inferno), Purgatory (Purgatorio), and Heaven (Paradiso). Guided by the poet Virgil and his beloved Beatrice, Dante explores themes of sin, redemption, and divine love, offering a theological and allegorical vision of the soul's journey toward God."
    },
    {
      "id": 12,
      "title": "The Inferno",
      "author": "Dante Alighieri",
      "image": "https://books.google.co.ke/books/content?id=htkrUmjuNjoC&pg=PP1&img=1&zoom=3&hl=en&bul=1&sig=ACfU3U3Y3sJQ4uVmocOXQ0EQxsd3eUyxpg&w=1280",
      "description": "The first part of 'The Divine Comedy', detailing Dante's descent into Hell.",
      "detailedDescription": "The first part of Dante Alighieri's epic poem The Divine Comedy, The Inferno recounts Dante's descent through the nine circles of Hell guided by the Roman poet Virgil. Each circle represents a different sin and punishment, from the relatively mild sins of incontinence to the most severe sins of betrayal. Through vivid imagery and allegorical encounters with historical and mythological figures, Dante explores themes of sin, justice, and the consequences of human actions."
    },
    {
      "id": 13,
      "title": "The Purgatorio",
      "author": "Dante Alighieri",
      "image": "https://books.google.co.ke/books/content?id=Glt-WfBRzEkC&pg=PP1&img=1&zoom=3&hl=en&bul=1&sig=ACfU3U2BcWBVlqZiaLDv9MJaWkEomYGyyw&w=1280",
      "description": "The second part of 'The Divine Comedy', describing Dante's ascent through Purgatory.",
      "detailedDescription": "In the second part of Dante Alighieri's The Divine Comedy, The Purgatorio, Dante ascends the mountain of Purgatory, guided by Virgil and later by Beatrice. Purgatory is depicted as a mountain with seven terraces, each representing one of the seven deadly sins. Here, souls undergo purification before ascending to Heaven. Through encounters with penitent souls and allegorical representations of virtue, Dante explores themes of repentance, redemption, and the transformative power of divine grace."
    },
    {
      "id": 14,
      "title": "The Paradiso",
      "author": "Dante Alighieri",
      "image": "https://books.google.co.ke/books/content?id=FGs9AAAAYAAJ&pg=PR3&img=1&zoom=3&hl=en&bul=1&sig=ACfU3U1a3EZfG-l7T3N7z9J3ovt6IeQTVg&w=1025",
      "description": "The final part of 'The Divine Comedy', depicting Dante's journey through Heaven.",
      "detailedDescription": "The final part of Dante Alighieri's The Divine Comedy, The Paradiso, depicts Dante's ascent through the celestial spheres of Heaven guided by Beatrice and illuminated by divine love. In each sphere, Dante encounters blessed souls, including saints, theologians, and martyrs, who reveal the glory of God and the order of the universe. Through mystical visions and philosophical contemplation, Dante explores themes of divine justice, the nature of God, and the eternal bliss of the redeemed soul."
    }
  ]